ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/Device/Include/HC32F448JATI.h
/**
 *******************************************************************************
 ** \brief Interrupt number enumeration
 ******************************************************************************/
typedef enum {
    INT_SRC_SWI_IRQ0             = 0U,
    INT_SRC_SWI_IRQ1             = 1U,
    INT_SRC_SWI_IRQ2             = 2U,
    INT_SRC_SWI_IRQ3             = 3U,
    INT_SRC_SWI_IRQ4             = 4U,
    INT_SRC_SWI_IRQ5             = 5U,
    INT_SRC_SWI_IRQ6             = 6U,
    INT_SRC_SWI_IRQ7             = 7U,
    INT_SRC_SWI_IRQ8             = 8U,
    INT_SRC_SWI_IRQ9             = 9U,
    INT_SRC_SWI_IRQ10            = 10U,
    INT_SRC_SWI_IRQ11            = 11U,
    INT_SRC_SWI_IRQ12            = 12U,
    INT_SRC_SWI_IRQ13            = 13U,
    INT_SRC_SWI_IRQ14            = 14U,
    INT_SRC_SWI_IRQ15            = 15U,
    INT_SRC_SWI_IRQ16            = 16U,
    INT_SRC_SWI_IRQ17            = 17U,
    INT_SRC_SWI_IRQ18            = 18U,
    INT_SRC_SWI_IRQ19            = 19U,
    INT_SRC_SWI_IRQ20            = 20U,
    INT_SRC_SWI_IRQ21            = 21U,
    INT_SRC_SWI_IRQ22            = 22U,
    INT_SRC_SWI_IRQ23            = 23U,
    INT_SRC_SWI_IRQ24            = 24U,
    INT_SRC_SWI_IRQ25            = 25U,
    INT_SRC_SWI_IRQ26            = 26U,
    INT_SRC_SWI_IRQ27            = 27U,
    INT_SRC_SWI_IRQ28            = 28U,
    INT_SRC_SWI_IRQ29            = 29U,
    INT_SRC_SWI_IRQ30            = 30U,
    INT_SRC_SWI_IRQ31            = 31U,
    /*  External Interrupt   */
    INT_SRC_PORT_EIRQ0           = 0U,      /* EIRQ0  */
    INT_SRC_PORT_EIRQ1           = 1U,      /* EIRQ1  */
    INT_SRC_PORT_EIRQ2           = 2U,      /* EIRQ2  */
    INT_SRC_PORT_EIRQ3           = 3U,      /* EIRQ3  */
    INT_SRC_PORT_EIRQ4           = 4U,      /* EIRQ4  */
    INT_SRC_PORT_EIRQ5           = 5U,      /* EIRQ5  */
    INT_SRC_PORT_EIRQ6           = 6U,      /* EIRQ6  */
    INT_SRC_PORT_EIRQ7           = 7U,      /* EIRQ7  */
    INT_SRC_PORT_EIRQ8           = 8U,      /* EIRQ8  */
    INT_SRC_PORT_EIRQ9           = 9U,      /* EIRQ9  */
    INT_SRC_PORT_EIRQ10          = 10U,     /* EIRQ10 */
    INT_SRC_PORT_EIRQ11          = 11U,     /* EIRQ11 */
    INT_SRC_PORT_EIRQ12          = 12U,     /* EIRQ12 */
    INT_SRC_PORT_EIRQ13          = 13U,     /* EIRQ13 */
    INT_SRC_PORT_EIRQ14          = 14U,     /* EIRQ14 */
    INT_SRC_PORT_EIRQ15          = 15U,     /* EIRQ15 */
    /*  DMA_1  */
    INT_SRC_DMA1_ERR             = 32U,     /* DMA_1_ERR  */
    INT_SRC_DMA1_TC0             = 33U,     /* DMA_1_TC0  */
    INT_SRC_DMA1_BTC0            = 34U,     /* DMA_1_BTC0 */
    INT_SRC_DMA1_TC1             = 35U,     /* DMA_1_TC1  */
    INT_SRC_DMA1_BTC1            = 36U,     /* DMA_1_BTC1 */
    INT_SRC_DMA1_TC2             = 37U,     /* DMA_1_TC2  */
    INT_SRC_DMA1_BTC2            = 38U,     /* DMA_1_BTC2 */
    INT_SRC_DMA1_TC3             = 39U,     /* DMA_1_TC3  */
    INT_SRC_DMA1_BTC3            = 40U,     /* DMA_1_BTC3 */
    INT_SRC_DMA1_TC4             = 41U,     /* DMA_1_TC4  */
    INT_SRC_DMA1_BTC4            = 42U,     /* DMA_1_BTC4 */
    INT_SRC_DMA1_TC5             = 43U,     /* DMA_1_TC5  */
    INT_SRC_DMA1_BTC5            = 44U,     /* DMA_1_BTC5 */
    /*  EFM  */
    INT_SRC_EFM_PEERR            = 49U,     /* EFM_PEERR  */
    INT_SRC_EFM_RDCOL            = 50U,     /* EFM_RDCOL  */
    INT_SRC_EFM_OPTEND           = 51U,     /* EFM_OPTEND */
    /*  QSPI  */
    INT_SRC_QSPI_INTR            = 54U,     /* QSPI_INTR */
    /*  DCU  */
    INT_SRC_DCU1                 = 55U,     /* DCU1 */
    INT_SRC_DCU2                 = 56U,     /* DCU2 */
    INT_SRC_DCU3                 = 57U,     /* DCU3 */
    INT_SRC_DCU4                 = 58U,     /* DCU4 */
    /*  DMA2  */
    INT_SRC_DMA2_ERR             = 64U,     /* DMA_2_ERR  */
    INT_SRC_DMA2_TC0             = 65U,     /* DMA_2_TC0  */
    INT_SRC_DMA2_BTC0            = 66U,     /* DMA_2_BTC0 */
    INT_SRC_DMA2_TC1             = 67U,     /* DMA_2_TC1  */
    INT_SRC_DMA2_BTC1            = 68U,     /* DMA_2_BTC1 */
    INT_SRC_DMA2_TC2             = 69U,     /* DMA_2_TC2  */
    INT_SRC_DMA2_BTC2            = 70U,     /* DMA_2_BTC2 */
    INT_SRC_DMA2_TC3             = 71U,     /* DMA_2_TC3  */
    INT_SRC_DMA2_BTC3            = 72U,     /* DMA_2_BTC3 */
    INT_SRC_DMA2_TC4             = 73U,     /* DMA_2_TC4  */
    INT_SRC_DMA2_BTC4            = 74U,     /* DMA_2_BTC4 */
    INT_SRC_DMA2_TC5             = 75U,     /* DMA_2_TC5  */
    INT_SRC_DMA2_BTC5            = 76U,     /* DMA_2_BTC5 */
    /*  TIMER0  */
    INT_SRC_TMR0_1_CMP_A         = 96U,     /* TMR0_1_CMPA */
    INT_SRC_TMR0_1_CMP_B         = 97U,     /* TMR0_1_CMPB */
    INT_SRC_TMR0_1_OVF_A         = 98U,     /* TMR0_1_OVFA */
    INT_SRC_TMR0_1_OVF_B         = 99U,     /* TMR0_1_OVFB */
    INT_SRC_TMR0_2_CMP_A         = 100U,    /* TMR0_2_CMPA */
    INT_SRC_TMR0_2_CMP_B         = 101U,    /* TMR0_2_CMPB */
    INT_SRC_TMR0_2_OVF_A         = 102U,    /* TMR0_2_OVFA */
    INT_SRC_TMR0_2_OVF_B         = 103U,    /* TMR0_2_OVFB */
    /*  RTC  */
    INT_SRC_RTC_ALM              = 121U,     /* RTC_ALM */
    INT_SRC_RTC_PRD              = 122U,     /* RTC_PRD */
    /*  XTAL  */
    INT_SRC_XTAL_STOP            = 125U,     /* XTAL_STOP */
    /*  WKTM  */
    INT_SRC_WKTM_PRD             = 126U,     /* WKTM_PRD */
    /*  SWDT  */
    INT_SRC_SWDT_REFUDF          = 127U,     /* SWDT_REFUDF */
    /*  TIMER6_1  */
    INT_SRC_TMR6_1_GCMP_A        = 128U,     /* TMR6_1_GCMA */
    INT_SRC_TMR6_1_GCMP_B        = 129U,     /* TMR6_1_GCMB */
    INT_SRC_TMR6_1_GCMP_C        = 130U,     /* TMR6_1_GCMC */
    INT_SRC_TMR6_1_GCMP_D        = 131U,     /* TMR6_1_GCMD */
    INT_SRC_TMR6_1_GCMP_E        = 132U,     /* TMR6_1_GCME */
    INT_SRC_TMR6_1_GCMP_F        = 133U,     /* TMR6_1_GCMF */
    INT_SRC_TMR6_1_OVF           = 134U,     /* TMR6_1_GOVF */
    INT_SRC_TMR6_1_UDF           = 135U,     /* TMR6_1_GUDF */
    INT_SRC_TMR6_1_DTE           = 136U,     /* TMR6_1_GDTE */
    INT_SRC_TMR6_1_SCMP_A        = 137U,     /* TMR6_1_SCMA */
    INT_SRC_TMR6_1_SCMP_B        = 138U,     /* TMR6_1_SCMB */
    /*  TIMERA_1  */
    INT_SRC_TMRA_1_OVF           = 139U,     /* TMRA_1_OVF */
    INT_SRC_TMRA_1_UDF           = 140U,     /* TMRA_1_UDF */
    INT_SRC_TMRA_1_CMP           = 141U,     /* TMRA_1_CMP */
    /*  TIMER6_2  */
    INT_SRC_TMR6_2_GCMP_A        = 144U,     /* TMR6_2_GCMA */
    INT_SRC_TMR6_2_GCMP_B        = 145U,     /* TMR6_2_GCMB */
    INT_SRC_TMR6_2_GCMP_C        = 146U,     /* TMR6_2_GCMC */
    INT_SRC_TMR6_2_GCMP_D        = 147U,     /* TMR6_2_GCMD */
    INT_SRC_TMR6_2_GCMP_E        = 148U,     /* TMR6_2_GCME */
    INT_SRC_TMR6_2_GCMP_F        = 149U,     /* TMR6_2_GCMF */
    INT_SRC_TMR6_2_OVF           = 150U,     /* TMR6_2_GOVF */
    INT_SRC_TMR6_2_UDF           = 151U,     /* TMR6_2_GUDF */
    INT_SRC_TMR6_2_DTE           = 152U,     /* TMR6_2_GDTE */
    INT_SRC_TMR6_2_SCMP_A        = 153U,     /* TMR6_2_SCMA */
    INT_SRC_TMR6_2_SCMP_B        = 154U,     /* TMR6_2_SCMB */
    /*  TIMERA_2  */
    INT_SRC_TMRA_2_OVF           = 155U,     /* TMRA_2_OVF */
    INT_SRC_TMRA_2_UDF           = 156U,     /* TMRA_2_UDF */
    INT_SRC_TMRA_2_CMP           = 157U,     /* TMRA_2_CMP */
    /*  TIMERA_3  */
    INT_SRC_TMRA_3_OVF           = 171U,     /* TMRA_3_OVF */
    INT_SRC_TMRA_3_UDF           = 172U,     /* TMRA_3_UDF */
    INT_SRC_TMRA_3_CMP           = 173U,     /* TMRA_3_CMP */
    /*  TIMERA_4  */
    INT_SRC_TMRA_4_OVF           = 187U,     /* TMRA_4_OVF */
    INT_SRC_TMRA_4_UDF           = 188U,     /* TMRA_4_UDF */
    INT_SRC_TMRA_4_CMP           = 189U,     /* TMRA_4_CMP */

    /*  TIMER4_1  */
    INT_SRC_TMR4_1_GCMP_UH       = 192U,     /* TMR4_1_GCMUH */
    INT_SRC_TMR4_1_GCMP_UL       = 193U,     /* TMR4_1_GCMUL */
    INT_SRC_TMR4_1_GCMP_VH       = 194U,     /* TMR4_1_GCMVH */
    INT_SRC_TMR4_1_GCMP_VL       = 195U,     /* TMR4_1_GCMVL */
    INT_SRC_TMR4_1_GCMP_WH       = 196U,     /* TMR4_1_GCMWH */
    INT_SRC_TMR4_1_GCMP_WL       = 197U,     /* TMR4_1_GCMWL */
    INT_SRC_TMR4_1_GCMP_XH       = 198U,     /* TMR4_1_GCMXH */
    INT_SRC_TMR4_1_GCMP_XL       = 199U,     /* TMR4_1_GCMXL */
    INT_SRC_TMR4_1_OVF           = 200U,     /* TMR4_1_GOVF  */
    INT_SRC_TMR4_1_UDF           = 201U,     /* TMR4_1_GUDF  */
    INT_SRC_TMR4_1_RELOAD_U      = 202U,     /* TMR4_1_GRLU  */
    INT_SRC_TMR4_1_RELOAD_V      = 203U,     /* TMR4_1_GRLV  */
    INT_SRC_TMR4_1_RELOAD_W      = 204U,     /* TMR4_1_GRLW  */
    INT_SRC_TMR4_1_RELOAD_X      = 205U,     /* TMR4_1_GRLX  */
    INT_SRC_TMR4_1_SCMP0         = 206U,     /* TMR4_1_SCM0 */
    INT_SRC_TMR4_1_SCMP1         = 207U,     /* TMR4_1_SCM1 */
    INT_SRC_TMR4_1_SCMP2         = 208U,     /* TMR4_1_SCM2 */
    INT_SRC_TMR4_1_SCMP3         = 209U,     /* TMR4_1_SCM3 */
    INT_SRC_TMR4_1_SCMP4         = 210U,     /* TMR4_1_SCM4 */
    INT_SRC_TMR4_1_SCMP5         = 211U,     /* TMR4_1_SCM5 */
    INT_SRC_TMR4_1_SCMP6         = 212U,     /* TMR4_1_SCM6 */
    INT_SRC_TMR4_1_SCMP7         = 213U,     /* TMR4_1_SCM7 */
    /*  TIMER4_2  */
    INT_SRC_TMR4_2_GCMP_UH       = 224U,     /* TMR4_2_GCMUH */
    INT_SRC_TMR4_2_GCMP_UL       = 225U,     /* TMR4_2_GCMUL */
    INT_SRC_TMR4_2_GCMP_VH       = 226U,     /* TMR4_2_GCMVH */
    INT_SRC_TMR4_2_GCMP_VL       = 227U,     /* TMR4_2_GCMVL */
    INT_SRC_TMR4_2_GCMP_WH       = 228U,     /* TMR4_2_GCMWH */
    INT_SRC_TMR4_2_GCMP_WL       = 229U,     /* TMR4_2_GCMWL */
    INT_SRC_TMR4_2_GCMP_XH       = 230U,     /* TMR4_2_GCMXH */
    INT_SRC_TMR4_2_GCMP_XL       = 231U,     /* TMR4_2_GCMXL */
    INT_SRC_TMR4_2_OVF           = 232U,     /* TMR4_2_GOVF  */
    INT_SRC_TMR4_2_UDF           = 233U,     /* TMR4_2_GUDF  */
    INT_SRC_TMR4_2_RELOAD_U      = 234U,     /* TMR4_2_GRLU  */
    INT_SRC_TMR4_2_RELOAD_V      = 235U,     /* TMR4_2_GRLV  */
    INT_SRC_TMR4_2_RELOAD_W      = 236U,     /* TMR4_2_GRLW  */
    INT_SRC_TMR4_2_RELOAD_X      = 237U,     /* TMR4_2_GRLX  */
    INT_SRC_TMR4_2_SCMP0         = 238U,     /* TMR4_2_SCM0  */
    INT_SRC_TMR4_2_SCMP1         = 239U,     /* TMR4_2_SCM1  */
    INT_SRC_TMR4_2_SCMP2         = 240U,     /* TMR4_2_SCM2  */
    INT_SRC_TMR4_2_SCMP3         = 241U,     /* TMR4_2_SCM3  */
    INT_SRC_TMR4_2_SCMP4         = 242U,     /* TMR4_2_SCM4  */
    INT_SRC_TMR4_2_SCMP5         = 243U,     /* TMR4_2_SCM5  */
    INT_SRC_TMR4_2_SCMP6         = 244U,     /* TMR4_2_SCM6  */
    INT_SRC_TMR4_2_SCMP7         = 245U,     /* TMR4_2_SCM7  */
    /*  TIMER4_3  */
    INT_SRC_TMR4_3_GCMP_UH       = 256U,     /* TMR4_3_GCMUH */
    INT_SRC_TMR4_3_GCMP_UL       = 257U,     /* TMR4_3_GCMUL */
    INT_SRC_TMR4_3_GCMP_VH       = 258U,     /* TMR4_3_GCMVH */
    INT_SRC_TMR4_3_GCMP_VL       = 259U,     /* TMR4_3_GCMVL */
    INT_SRC_TMR4_3_GCMP_WH       = 260U,     /* TMR4_3_GCMWH */
    INT_SRC_TMR4_3_GCMP_WL       = 261U,     /* TMR4_3_GCMWL */
    INT_SRC_TMR4_3_GCMP_XH       = 262U,     /* TMR4_3_GCMXH */
    INT_SRC_TMR4_3_GCMP_XL       = 263U,     /* TMR4_3_GCMXL */
    INT_SRC_TMR4_3_OVF           = 264U,     /* TMR4_3_GOVF  */
    INT_SRC_TMR4_3_UDF           = 265U,     /* TMR4_3_GUDF  */
    INT_SRC_TMR4_3_RELOAD_U      = 266U,     /* TMR4_3_GRLU  */
    INT_SRC_TMR4_3_RELOAD_V      = 267U,     /* TMR4_3_GRLV  */
    INT_SRC_TMR4_3_RELOAD_W      = 268U,     /* TMR4_3_GRLW  */
    INT_SRC_TMR4_3_RELOAD_X      = 269U,     /* TMR4_3_GRLX  */
    INT_SRC_TMR4_3_SCMP0         = 270U,     /* TMR4_3_SCM0  */
    INT_SRC_TMR4_3_SCMP1         = 271U,     /* TMR4_3_SCM1  */
    INT_SRC_TMR4_3_SCMP2         = 272U,     /* TMR4_3_SCM2  */
    INT_SRC_TMR4_3_SCMP3         = 273U,     /* TMR4_3_SCM3  */
    INT_SRC_TMR4_3_SCMP4         = 274U,     /* TMR4_3_SCM4  */
    INT_SRC_TMR4_3_SCMP5         = 275U,     /* TMR4_3_SCM5  */
    INT_SRC_TMR4_3_SCMP6         = 276U,     /* TMR4_3_SCM6  */
    INT_SRC_TMR4_3_SCMP7         = 277U,     /* TMR4_3_SCM7  */
    /*  I2C1  */
    INT_SRC_I2C1_RXI             = 288U,     /* I2C_1_RXI */
    INT_SRC_I2C1_TXI             = 289U,     /* I2C_1_TXI */
    INT_SRC_I2C1_TEI             = 290U,     /* I2C_1_TEI */
    INT_SRC_I2C1_EEI             = 291U,     /* I2C_1_EEI */
    /*  I2C2  */
    INT_SRC_I2C2_RXI             = 292U,     /* I2C_2_RXI */
    INT_SRC_I2C2_TXI             = 293U,     /* I2C_2_TXI */
    INT_SRC_I2C2_TEI             = 294U,     /* I2C_2_TEI */
    INT_SRC_I2C2_EEI             = 295U,     /* I2C_2_EEI */
    /*  CMP  */
    INT_SRC_CMP1                 = 312U,     /* CMP_1_IRQ */
    INT_SRC_CMP2                 = 313U,     /* CMP_2_IRQ */
    INT_SRC_CMP3                 = 314U,     /* CMP_3_IRQ */
    INT_SRC_CMP4                 = 315U,     /* CMP_4_IRQ */
    /*  USART1  */
    INT_SRC_USART1_EI            = 321U,     /* USART_1_EI    */
    INT_SRC_USART1_RI            = 322U,     /* USART_1_RI    */
    INT_SRC_USART1_TI            = 323U,     /* USART_1_TI    */
    INT_SRC_USART1_RTO           = 324U,     /* USART_1_RTO   */
    INT_SRC_USART1_TENDI         = 325U,     /* USART_1_TENDI */
    INT_SRC_USART1_TCI           = 326U,     /* USART_1_TCI   */
    /*  USART2  */
    INT_SRC_USART2_EI            = 328U,     /* USART_2_EI    */
    INT_SRC_USART2_RI            = 329U,     /* USART_2_RI    */
    INT_SRC_USART2_TI            = 330U,     /* USART_2_TI    */
    INT_SRC_USART2_RTO           = 331U,     /* USART_2_RTO   */
    INT_SRC_USART2_TENDI         = 332U,     /* USART_2_TENDI */
    INT_SRC_USART2_TCI           = 333U,     /* USART_2_TCI   */
    /*  SPI1  */
    INT_SRC_SPI1_SPRI            = 334U,     /* SPI_1_SPRI */
    INT_SRC_SPI1_SPTI            = 335U,     /* SPI_1_SPTI */
    INT_SRC_SPI1_SPII            = 336U,     /* SPI_1_SPII */
    INT_SRC_SPI1_SPEI            = 337U,     /* SPI_1_SPEI */
    /*  TIMERA_5  */
    INT_SRC_TMRA_5_OVF           = 340U,     /* TMRA_5_OVF */
    INT_SRC_TMRA_5_UDF           = 341U,     /* TMRA_5_UDF */
    INT_SRC_TMRA_5_CMP           = 342U,     /* TMRA_5_CMP */
    /*  EVENT PORT  */
    INT_SRC_EVENT_PORT1          = 348U,     /* EVENT_PORT1 */
    INT_SRC_EVENT_PORT2          = 349U,     /* EVENT_PORT2 */
    INT_SRC_EVENT_PORT3          = 350U,     /* EVENT_PORT3 */
    INT_SRC_EVENT_PORT4          = 351U,     /* EVENT_PORT4 */
    /*  USART3  */
    INT_SRC_USART3_BRKWKPI       = 352U,     /* USART_3_BRKWKPI */
    INT_SRC_USART3_EI            = 353U,     /* USART_3_EI      */
    INT_SRC_USART3_RI            = 354U,     /* USART_3_RI      */
    INT_SRC_USART3_TI            = 355U,     /* USART_3_TI      */
    INT_SRC_USART3_TENDI         = 357U,     /* USART_3_TENDI   */
    INT_SRC_USART3_TCI           = 358U,     /* USART_3_TCI     */
    /*  USART4  */
    INT_SRC_USART4_EI            = 360U,     /* USART_4_EI    */
    INT_SRC_USART4_RI            = 361U,     /* USART_4_RI    */
    INT_SRC_USART4_TI            = 362U,     /* USART_4_TI    */
    INT_SRC_USART4_RTO           = 363U,     /* USART_4_RTO   */
    INT_SRC_USART4_TENDI         = 364U,     /* USART_4_TENDI */
    INT_SRC_USART4_TCI           = 365U,     /* USART_4_TCI   */
    /*  SPI2  */
    INT_SRC_SPI2_SPRI            = 366U,     /* SPI_2_SPRI */
    INT_SRC_SPI2_SPTI            = 367U,     /* SPI_2_SPTI */
    INT_SRC_SPI2_SPII            = 368U,     /* SPI_2_SPII */
    INT_SRC_SPI2_SPEI            = 369U,     /* SPI_2_SPEI */
    /*  SPI3  */
    INT_SRC_SPI3_SPRI            = 371U,     /* SPI_3_SPRI */
    INT_SRC_SPI3_SPTI            = 372U,     /* SPI_3_SPTI */
    INT_SRC_SPI3_SPII            = 373U,     /* SPI_3_SPII */
    INT_SRC_SPI3_SPEI            = 374U,     /* SPI_3_SPEI */
    /*  EMB  */
    INT_SRC_EMB_GR0              = 376U,     /* EMB_GR0 */
    INT_SRC_EMB_GR1              = 377U,     /* EMB_GR1 */
    INT_SRC_EMB_GR2              = 378U,     /* EMB_GR2 */
    INT_SRC_EMB_GR3              = 379U,     /* EMB_GR3 */
    /*  USART5  */
    INT_SRC_USART5_EI            = 385U,     /* USART_5_EI    */
    INT_SRC_USART5_RI            = 386U,     /* USART_5_RI    */
    INT_SRC_USART5_TI            = 387U,     /* USART_5_TI    */
    INT_SRC_USART5_RTO           = 388U,     /* USART_5_RTO   */
    INT_SRC_USART5_TENDI         = 389U,     /* USART_5_TENDI */
    INT_SRC_USART5_TCI           = 390U,     /* USART_5_TCI   */
    /*  USART6  */
    INT_SRC_USART6_BRKWKPI       = 391U,     /* USART_6_BRKWKPI */
    INT_SRC_USART6_EI            = 392U,     /* USART_6_EI      */
    INT_SRC_USART6_RI            = 393U,     /* USART_6_RI      */
    INT_SRC_USART6_TI            = 394U,     /* USART_6_TI      */
    INT_SRC_USART6_TENDI         = 395U,     /* USART_6_TENDI   */
    INT_SRC_USART6_TCI           = 396U,     /* USART_6_TCI     */
    /*  MCAN  */
    INT_SRC_MCAN1_INT0           = 408U,     /* MCAN1_INT_LINE0 */
    INT_SRC_MCAN1_INT1           = 409U,     /* MCAN1_INT_LINE1 */
    INT_SRC_MCAN2_INT0           = 410U,     /* MCAN2_INT_LINE0 */
    INT_SRC_MCAN2_INT1           = 411U,     /* MCAN2_INT_LINE1 */
    /*  USART1  */
    INT_SRC_USART1_WUPI          = 464U,     /* USART_1_WUPI */
    /*  FCM  */
    INT_SRC_FCMFERRI             = 468U,     /* FCMFERRI */
    INT_SRC_FCMMENDI             = 469U,     /* FCMMENDI */
    INT_SRC_FCMCOVFI             = 470U,     /* FCMCOVFI */
    /*  WDT  */
    INT_SRC_WDT_REFUDF           = 471U,     /* WDT_REFUDF */
    /*  CTC  */
    INT_SRC_CTC_ERR              = 472U,     /* CTC_ERR */
    /*  ADC1  */
    INT_SRC_ADC1_EOCA            = 480U,     /* ADC_1_EOCA */
    INT_SRC_ADC1_EOCB            = 481U,     /* ADC_1_EOCB */
    INT_SRC_ADC1_CMP0            = 482U,     /* ADC_1_CMP0 */
    INT_SRC_ADC1_CMP1            = 483U,     /* ADC_1_CMP1 */
    /*  ADC2  */
    INT_SRC_ADC2_EOCA            = 484U,     /* ADC_2_EOCA */
    INT_SRC_ADC2_EOCB            = 485U,     /* ADC_2_EOCB */
    INT_SRC_ADC2_CMP0            = 486U,     /* ADC_2_CMP0 */
    INT_SRC_ADC2_CMP1            = 487U,     /* ADC_2_CMP1 */
    /*  ADC3  */
    INT_SRC_ADC3_EOCA            = 488U,     /* ADC_3_EOCA */
    INT_SRC_ADC3_EOCB            = 489U,     /* ADC_3_EOCB */
    INT_SRC_ADC3_CMP0            = 490U,     /* ADC_3_CMP0 */
    INT_SRC_ADC3_CMP1            = 491U,     /* ADC_3_CMP1 */
    /*  TRNG  */
    INT_SRC_TRNG_END             = 492U,     /* TRNG_END */
    INT_SRC_MAX                  = 511U,
} en_int_src_t;

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

/**
 * @brief ADC
 */
typedef struct {
    __IO uint8_t  STR;
    uint8_t RESERVED0[1];
    __IO uint16_t CR0;
    __IO uint16_t CR1;
    __IO uint16_t CR2;
    uint8_t RESERVED1[2];
    __IO uint16_t TRGSR;
    __IO uint32_t CHSELRA;
    __IO uint32_t CHSELRB;
    __IO uint32_t AVCHSELR;
    __IO uint8_t  EXCHSELR;
    uint8_t RESERVED2[7];
    __IO uint8_t  SSTR0;
    __IO uint8_t  SSTR1;
    __IO uint8_t  SSTR2;
    __IO uint8_t  SSTR3;
    __IO uint8_t  SSTR4;
    __IO uint8_t  SSTR5;
    __IO uint8_t  SSTR6;
    __IO uint8_t  SSTR7;
    __IO uint8_t  SSTR8;
    __IO uint8_t  SSTR9;
    __IO uint8_t  SSTR10;
    __IO uint8_t  SSTR11;
    __IO uint8_t  SSTR12;
    __IO uint8_t  SSTR13;
    __IO uint8_t  SSTR14;
    __IO uint8_t  SSTR15;
    uint8_t RESERVED3[8];
    __IO uint16_t CHMUXR0;
    __IO uint16_t CHMUXR1;
    __IO uint16_t CHMUXR2;
    __IO uint16_t CHMUXR3;
    uint8_t RESERVED4[4];
    __I  uint8_t  ISR;
    __IO uint8_t  ICR;
    __O  uint8_t  ISCLRR;
    uint8_t RESERVED5[5];
    __IO uint16_t SYNCCR;
    uint8_t RESERVED6[2];
    __I  uint16_t DR0;
    __I  uint16_t DR1;
    __I  uint16_t DR2;
    __I  uint16_t DR3;
    __I  uint16_t DR4;
    __I  uint16_t DR5;
    __I  uint16_t DR6;
    __I  uint16_t DR7;
    __I  uint16_t DR8;
    __I  uint16_t DR9;
    __I  uint16_t DR10;
    __I  uint16_t DR11;
    __I  uint16_t DR12;
    __I  uint16_t DR13;
    __I  uint16_t DR14;
    __I  uint16_t DR15;
    uint8_t RESERVED7[48];
    __IO uint16_t AWDCR;
    __I  uint8_t  AWDSR;
    __O  uint8_t  AWDSCLRR;
    __IO uint16_t AWD0DR0;
    __IO uint16_t AWD0DR1;
    __IO uint8_t  AWD0CHSR;
    uint8_t RESERVED8[3];
    __IO uint16_t AWD1DR0;
    __IO uint16_t AWD1DR1;
    __IO uint8_t  AWD1CHSR;
} CM_ADC_TypeDef;

/**
 * @brief AES
 */
typedef struct {
    __IO uint32_t CR;
    uint8_t RESERVED0[12];
    __IO uint32_t DR0;
    __IO uint32_t DR1;
    __IO uint32_t DR2;
    __IO uint32_t DR3;
    __IO uint32_t KR0;
    __IO uint32_t KR1;
    __IO uint32_t KR2;
    __IO uint32_t KR3;
    __IO uint32_t KR4;
    __IO uint32_t KR5;
    __IO uint32_t KR6;
    __IO uint32_t KR7;
} CM_AES_TypeDef;

/**
 * @brief AOS
 */
typedef struct {
    __O  uint32_t INTSFTTRG;
    __IO uint32_t DCU_TRGSEL1;
    __IO uint32_t DCU_TRGSEL2;
    __IO uint32_t DCU_TRGSEL3;
    __IO uint32_t DCU_TRGSEL4;
    __IO uint32_t DMA1_TRGSEL0;
    __IO uint32_t DMA1_TRGSEL1;
    __IO uint32_t DMA1_TRGSEL2;
    __IO uint32_t DMA1_TRGSEL3;
    __IO uint32_t DMA1_TRGSEL4;
    __IO uint32_t DMA1_TRGSEL5;
    __IO uint32_t DMA2_TRGSEL0;
    __IO uint32_t DMA2_TRGSEL1;
    __IO uint32_t DMA2_TRGSEL2;
    __IO uint32_t DMA2_TRGSEL3;
    __IO uint32_t DMA2_TRGSEL4;
    __IO uint32_t DMA2_TRGSEL5;
    __IO uint32_t DMA_RC_TRGSEL;
    __IO uint32_t TMR6_TRGSEL0;
    __IO uint32_t TMR6_TRGSEL1;
    __IO uint32_t TMR4_TRGSEL0;
    __IO uint32_t TMR4_TRGSEL1;
    __IO uint32_t TMR4_TRGSEL2;
    __IO uint32_t PEVNT_TRGSEL12;
    __IO uint32_t PEVNT_TRGSEL34;
    __IO uint32_t TMR0_TRGSEL;
    __IO uint32_t TMRA_TRGSEL0;
    __IO uint32_t TMRA_TRGSEL1;
    __IO uint32_t TMRA_TRGSEL2;
    __IO uint32_t TMRA_TRGSEL3;
    __IO uint32_t ADC1_TRGSEL0;
    __IO uint32_t ADC1_TRGSEL1;
    __IO uint32_t ADC2_TRGSEL0;
    __IO uint32_t ADC2_TRGSEL1;
    __IO uint32_t ADC3_TRGSEL0;
    __IO uint32_t ADC3_TRGSEL1;
    __IO uint32_t COMTRGSEL1;
    __IO uint32_t COMTRGSEL2;
    uint8_t RESERVED0[104];
    __IO uint32_t PEVNTDIRR1;
    __I  uint32_t PEVNTIDR1;
    __IO uint32_t PEVNTODR1;
    __IO uint32_t PEVNTORR1;
    __IO uint32_t PEVNTOSR1;
    __IO uint32_t PEVNTRISR1;
    __IO uint32_t PEVNTFALR1;
    __IO uint32_t PEVNTDIRR2;
    __I  uint32_t PEVNTIDR2;
    __IO uint32_t PEVNTODR2;
    __IO uint32_t PEVNTORR2;
    __IO uint32_t PEVNTOSR2;
    __IO uint32_t PEVNTRISR2;
    __IO uint32_t PEVNTFALR2;
    __IO uint32_t PEVNTDIRR3;
    __I  uint32_t PEVNTIDR3;
    __IO uint32_t PEVNTODR3;
    __IO uint32_t PEVNTORR3;
    __IO uint32_t PEVNTOSR3;
    __IO uint32_t PEVNTRISR3;
    __IO uint32_t PEVNTFALR3;
    __IO uint32_t PEVNTDIRR4;
    __I  uint32_t PEVNTIDR4;
    __IO uint32_t PEVNTODR4;
    __IO uint32_t PEVNTORR4;
    __IO uint32_t PEVNTOSR4;
    __IO uint32_t PEVNTRISR4;
    __IO uint32_t PEVNTFALR4;
    __IO uint32_t PEVNTNFCR;
    uint8_t RESERVED1[140];
    __IO uint32_t PLU0_CR;
    __IO uint32_t PLU1_CR;
    __IO uint32_t PLU2_CR;
    __IO uint32_t PLU3_CR;
    __IO uint32_t PLU0_TRGSELA;
    __IO uint32_t PLU0_TRGSELB;
    __IO uint32_t PLU0_TRGSELC;
    __IO uint32_t PLU0_TRGSELD;
    __IO uint32_t PLU1_TRGSELA;
    __IO uint32_t PLU1_TRGSELB;
    __IO uint32_t PLU1_TRGSELC;
    __IO uint32_t PLU1_TRGSELD;
    __IO uint32_t PLU2_TRGSELA;
    __IO uint32_t PLU2_TRGSELB;
    __IO uint32_t PLU2_TRGSELC;
    __IO uint32_t PLU2_TRGSELD;
    __IO uint32_t PLU3_TRGSELA;
    __IO uint32_t PLU3_TRGSELB;
    __IO uint32_t PLU3_TRGSELC;
    __IO uint32_t PLU3_TRGSELD;
} CM_AOS_TypeDef;

/**
 * @brief CMP
 */
typedef struct {
    __IO uint8_t  MDR;
    __IO uint8_t  FIR;
    __IO uint8_t  OCR;
    uint8_t RESERVED0[1];
    __IO uint32_t PMSR;
    uint8_t RESERVED1[8];
    __IO uint32_t BWSR1;
    __IO uint16_t BWSR2;
    uint8_t RESERVED2[2];
    __IO uint32_t SCCR;
    __IO uint32_t SCMR;
} CM_CMP_TypeDef;

