ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/Device/Include/HC32F448JATI.h
typedef struct {
    __IO uint32_t SEN;
    uint32_t RESERVED0[31];
} stc_keyscan_ser_bit_t;

typedef struct {
    uint32_t RESERVED0[23];
    __IO uint32_t TDC;
    uint32_t RESERVED1[8];
} stc_mcan_dbtp_bit_t;

typedef struct {
    uint32_t RESERVED0[4];
    __IO uint32_t LBCK;
    uint32_t RESERVED1[2];
    __I  uint32_t RX;
    uint32_t RESERVED2[5];
    __I  uint32_t PVAL;
    uint32_t RESERVED3[7];
    __I  uint32_t SVAL;
    uint32_t RESERVED4[10];
} stc_mcan_test_bit_t;

typedef struct {
    __IO uint32_t INIT;
    __IO uint32_t CCE;
    __IO uint32_t ASM;
    __I  uint32_t CSA;
    __IO uint32_t CSR;
    __IO uint32_t MON;
    __IO uint32_t DAR;
    __IO uint32_t TEST;
    __IO uint32_t FDOE;
    __IO uint32_t BRSE;
    __IO uint32_t UTSU;
    __IO uint32_t WMM;
    __IO uint32_t PXHD;
    __IO uint32_t EFBI;
    __IO uint32_t TXP;
    __IO uint32_t NISO;
    uint32_t RESERVED0[16];
} stc_mcan_cccr_bit_t;

typedef struct {
    __IO uint32_t ETOC;
    uint32_t RESERVED0[31];
} stc_mcan_tocc_bit_t;

typedef struct {
    uint32_t RESERVED0[15];
    __I  uint32_t RP;
    uint32_t RESERVED1[16];
} stc_mcan_ecr_bit_t;

typedef struct {
    uint32_t RESERVED0[5];
    __I  uint32_t EP;
    __I  uint32_t EW;
    __I  uint32_t BO;
    uint32_t RESERVED1[3];
    __I  uint32_t RESI;
    __I  uint32_t RBRS;
    __I  uint32_t RFDF;
    __I  uint32_t PXE;
    uint32_t RESERVED2[17];
} stc_mcan_psr_bit_t;

typedef struct {
    __IO uint32_t RF0N;
    __IO uint32_t RF0W;
    __IO uint32_t RF0F;
    __IO uint32_t RF0L;
    __IO uint32_t RF1N;
    __IO uint32_t RF1W;
    __IO uint32_t RF1F;
    __IO uint32_t RF1L;
    __IO uint32_t HPM;
    __IO uint32_t TC;
    __IO uint32_t TCF;
    __IO uint32_t TFE;
    __IO uint32_t TEFN;
    __IO uint32_t TEFW;
    __IO uint32_t TEFF;
    __IO uint32_t TEFL;
    __IO uint32_t TSW;
    __IO uint32_t MRAF;
    __IO uint32_t TOO;
    __IO uint32_t DRX;
    __IO uint32_t BEC;
    __IO uint32_t BEU;
    __IO uint32_t ELO;
    __IO uint32_t EP;
    __IO uint32_t EW;
    __IO uint32_t BO;
    __IO uint32_t WDI;
    __IO uint32_t PEA;
    __IO uint32_t PED;
    __IO uint32_t ARA;
    uint32_t RESERVED0[2];
} stc_mcan_ir_bit_t;

typedef struct {
    __IO uint32_t RF0NE;
    __IO uint32_t RF0WE;
    __IO uint32_t RF0FE;
    __IO uint32_t RF0LE;
    __IO uint32_t RF1NE;
    __IO uint32_t RF1WE;
    __IO uint32_t RF1FE;
    __IO uint32_t RF1LE;
    __IO uint32_t HPME;
    __IO uint32_t TCE;
    __IO uint32_t TCFE;
    __IO uint32_t TFEE;
    __IO uint32_t TEFNE;
    __IO uint32_t TEFWE;
    __IO uint32_t TEFFE;
    __IO uint32_t TEFLE;
    __IO uint32_t TSWE;
    __IO uint32_t MRAFE;
    __IO uint32_t TOOE;
    __IO uint32_t DRXE;
    __IO uint32_t BECE;
    __IO uint32_t BEUE;
    __IO uint32_t ELOE;
    __IO uint32_t EPE;
    __IO uint32_t EWE;
    __IO uint32_t BOE;
    __IO uint32_t WDIE;
    __IO uint32_t PEAE;
    __IO uint32_t PEDE;
    __IO uint32_t ARAE;
    uint32_t RESERVED0[2];
} stc_mcan_ie_bit_t;

typedef struct {
    __IO uint32_t RF0NL;
    __IO uint32_t RF0WL;
    __IO uint32_t RF0FL;
    __IO uint32_t RF0LL;
    __IO uint32_t RF1NL;
    __IO uint32_t RF1WL;
    __IO uint32_t RF1FL;
    __IO uint32_t RF1LL;
    __IO uint32_t HPML;
    __IO uint32_t TCL;
    __IO uint32_t TCFL;
    __IO uint32_t TFEL;
    __IO uint32_t TEFNL;
    __IO uint32_t TEFWL;
    __IO uint32_t TEFFL;
    __IO uint32_t TEFLL;
    __IO uint32_t TSWL;
    __IO uint32_t MRAFL;
    __IO uint32_t TOOL;
    __IO uint32_t DRXL;
    __IO uint32_t BECL;
    __IO uint32_t BEUL;
    __IO uint32_t ELOL;
    __IO uint32_t EPL;
    __IO uint32_t EWL;
    __IO uint32_t BOL;
    __IO uint32_t WDIL;
    __IO uint32_t PEAL;
    __IO uint32_t PEDL;
    __IO uint32_t ARAL;
    uint32_t RESERVED0[2];
} stc_mcan_ils_bit_t;

typedef struct {
    __IO uint32_t EINT0;
    __IO uint32_t EINT1;
    uint32_t RESERVED0[30];
} stc_mcan_ile_bit_t;

typedef struct {
    __IO uint32_t RRFE;
    __IO uint32_t RRFS;
    uint32_t RESERVED0[30];
} stc_mcan_gfc_bit_t;

typedef struct {
    uint32_t RESERVED0[15];
    __I  uint32_t FLST;
    uint32_t RESERVED1[16];
} stc_mcan_hpms_bit_t;

typedef struct {
    __IO uint32_t ND0;
    __IO uint32_t ND1;
    __IO uint32_t ND2;
    __IO uint32_t ND3;
    __IO uint32_t ND4;
    __IO uint32_t ND5;
    __IO uint32_t ND6;
    __IO uint32_t ND7;
    __IO uint32_t ND8;
    __IO uint32_t ND9;
    __IO uint32_t ND10;
    __IO uint32_t ND11;
    __IO uint32_t ND12;
    __IO uint32_t ND13;
    __IO uint32_t ND14;
    __IO uint32_t ND15;
    __IO uint32_t ND16;
    __IO uint32_t ND17;
    __IO uint32_t ND18;
    __IO uint32_t ND19;
    __IO uint32_t ND20;
    __IO uint32_t ND21;
    __IO uint32_t ND22;
    __IO uint32_t ND23;
    __IO uint32_t ND24;
    __IO uint32_t ND25;
    __IO uint32_t ND26;
    __IO uint32_t ND27;
    __IO uint32_t ND28;
    __IO uint32_t ND29;
    __IO uint32_t ND30;
    __IO uint32_t ND31;
} stc_mcan_ndat1_bit_t;

typedef struct {
    __IO uint32_t ND32;
    __IO uint32_t ND33;
    __IO uint32_t ND34;
    __IO uint32_t ND35;
    __IO uint32_t ND36;
    __IO uint32_t ND37;
    __IO uint32_t ND38;
    __IO uint32_t ND39;
    __IO uint32_t ND40;
    __IO uint32_t ND41;
    __IO uint32_t ND42;
    __IO uint32_t ND43;
    __IO uint32_t ND44;
    __IO uint32_t ND45;
    __IO uint32_t ND46;
    __IO uint32_t ND47;
    __IO uint32_t ND48;
    __IO uint32_t ND49;
    __IO uint32_t ND50;
    __IO uint32_t ND51;
    __IO uint32_t ND52;
    __IO uint32_t ND53;
    __IO uint32_t ND54;
    __IO uint32_t ND55;
    __IO uint32_t ND56;
    __IO uint32_t ND57;
    __IO uint32_t ND58;
    __IO uint32_t ND59;
    __IO uint32_t ND60;
    __IO uint32_t ND61;
    __IO uint32_t ND62;
    __IO uint32_t ND63;
} stc_mcan_ndat2_bit_t;

typedef struct {
    uint32_t RESERVED0[31];
    __IO uint32_t F0OM;
} stc_mcan_rxf0c_bit_t;

typedef struct {
    uint32_t RESERVED0[24];
    __I  uint32_t F0F;
    __I  uint32_t RF0L;
    uint32_t RESERVED1[6];
} stc_mcan_rxf0s_bit_t;

typedef struct {
    uint32_t RESERVED0[31];
    __IO uint32_t F1OM;
} stc_mcan_rxf1c_bit_t;

